name: "3DSTN-FRGC2Net"
layer {
  name: "data"
  type: "TridimData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 112
    mean_value: 128
    mean_value: 128
    mean_value: 128
    mirror: false
  }
  tridim_data_param {
    source: "/data3/FRGC-2.0-EXP3/train_01.lst"
    root_folder: "/data3/FRGC-2.0-EXP3/train_data/"
    new_length: 180
    new_height: 120
    new_width: 160
    use_image: true
    show_data: false
    batch_size: 1
    shuffle: false
  }
}
layer {
  name: "data"
  type: "TridimData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 112
    mean_value: 128
    mean_value: 128
    mean_value: 128
    mirror: false
  }
  tridim_data_param {
    source: "/data3/FRGC-2.0-EXP3/train_01.lst"
    root_folder: "/data3/FRGC-2.0-EXP3/train_data/"
    new_length: 180
    new_height: 120
    new_width: 160
    use_image: true
    show_data: false
    batch_size: 1
    shuffle: false
  }
}
layer {
  name: "loc_conv1"
  type: "TridimConvolution"
  bottom: "data"
  top: "loc_conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  tridim_convolution_param {
    num_output: 12
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      #type: "xavier"
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loc_pool1"
  type: "TridimPooling"
  bottom: "loc_conv1"
  top: "loc_pool1"
  tridim_pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "loc_relu1"
  type: "ReLU"
  bottom: "loc_pool1"
  top: "loc_pool1"
}
layer {
  name: "loc_conv2"
  type: "TridimConvolution"
  bottom: "loc_pool1"
  top: "loc_conv2"
  tridim_convolution_param {
    num_output: 12
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      #type: "xavier"
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loc_pool2"
  type: "TridimPooling"
  bottom: "loc_conv2"
  top: "loc_pool2"
  tridim_pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "loc_relu2"
  type: "ReLU"
  bottom: "loc_pool2"
  top: "loc_pool2"
}
layer {
  name: "loc_ip1"
  type: "InnerProduct"
  bottom: "loc_pool2"
  top: "loc_ip1"
  inner_product_param {
    num_output: 12
    weight_filler {
      #type: "xavier"
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loc_relu3"
  type: "ReLU"
  bottom: "loc_ip1"
  top: "loc_ip1"
}
layer {
  name: "loc_reg"
  type: "InnerProduct"
  bottom: "loc_ip1"
  top: "theta"
  inner_product_param {
    num_output: 12
    weight_filler {
      type: "constant"
      value: 0
    }
    bias_filler {
      type: "file"
      file: "examples/tridim_frgc/bias_init.txt"
    }
  }
}
layer {
  name: "st_layer"
  type: "TridimSpatialTransformer"
  bottom: "data"
  bottom: "theta"
  top: "st_output"
}
layer {
  name: "conv1"
  type: "TridimConvolution"
  bottom: "st_output"
  top: "conv1"
  tridim_convolution_param {
    num_output: 16
    kernel_size: 5
    stride: 1
    weight_filler {
      #type: "xavier"
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "TridimPooling"
  bottom: "conv1"
  top: "pool1"
  tridim_pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "pool1"
  top: "pool1"
}
layer {
  name: "conv2"
  type: "TridimConvolution"
  bottom: "pool1"
  top: "conv2"
  tridim_convolution_param {
    num_output: 8
    kernel_size: 5
    stride: 1
    weight_filler {
      #type: "xavier"
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool2"
  type: "TridimPooling"
  bottom: "conv2"
  top: "pool2"
  tridim_pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "pool2"
  top: "pool2"
}
layer {
  name: "classification"
  type: "InnerProduct"
  bottom: "pool2"
  top: "class"
  inner_product_param {
    num_output: 556
    weight_filler {
      #type: "xavier"
      type: "gaussian"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "class"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "class"
  bottom: "label"
  top: "loss"
}
